/* 
1.Дана маса М в кілограмах. Використовуючи операцію поділу націло, знайдіть в ній кількість загальних тонн
2.Задається ціле число A. Перевірте істинність твердження: «Число А непарне».
3.Задається ціле число. Якщо воно позитивне, додайте до нього 1; В іншому випадку відніміть від нього 2. Виведіть отримане число.
4. Дано ціле число K. Вивести рядок-опис оцінки, відповідну числу К (1 - "погано", 2 - "незадовільно", 3 - "задовільно", 4 - "добре", 5 - "відмінно"). Якщо К лежить не в діапазоні 1-5, то виведіть рядок «error»
5.Дано два цілих числа A і B (A < B). Вивести в порядку зростання всі цілі числа, розташовані між A і B (включаючи самі числа A і B), а також число N цих чисел.
6.Даються позитивні числа А і В (А > В). На відрізку довжини А є максимально можлива кількість відрізків довжини В (без перекриттів). Не використовуючи операції множення і ділення, знайдіть кількість відрізків B, розміщених на відрізку A.
*/
package gr_1;

public class Lab0 {
    public static int num1(int int1) {
        return int1/1000;
    }
    public static boolean num2(int int2) {
        return int2%2>0;
    }
    public static int num3(int int1) {
        if(int1>0){
          return int1+1;
        } else {
          return int1-2;
        }
      }
      public static String num4(int int1) {
        switch(int1){
          case 1:
            return "Погано"; 
          case 2:
            return "Незадовільно";
          case 3:
            return "Задовільно"; 
          case 4:
            return "Добре"; 
          case 5:
            return "Відмінно"; 
          default: 
            return "Error";
        }
      }
      public static int num5(int int1,int int2) {
        int j = 0;
        for(int i=int2;i<=int1;i++){
          j=j+1;
        }
        return j;
      }
      public static int num6(int int1,int int2) {
        int n=int2;
        int j = 0;
        while(n<=int1){
          j=j+1;
          n=n+int2;
        }
        return j;
      } 
}

